espressif/esp-idf/components/soc/esp32h4/register/soc/touch_reg.h
/**
 * SPDX-FileCopyrightText: 2025-2026 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include "soc/soc.h"
#ifdef __cplusplus
extern "C" {
#endif

/** TOUCH_INT_RAW_REG register
 *  need_des
 */
#define TOUCH_INT_RAW_REG (DR_REG_TOUCH_SENS_BASE + 0x0)
/** TOUCH_SCAN_DONE_INT_RAW : R/WTC/SS; bitpos: [0]; default: 0;
 *  need_des
 */
#define TOUCH_SCAN_DONE_INT_RAW    (BIT(0))
#define TOUCH_SCAN_DONE_INT_RAW_M  (TOUCH_SCAN_DONE_INT_RAW_V << TOUCH_SCAN_DONE_INT_RAW_S)
#define TOUCH_SCAN_DONE_INT_RAW_V  0x00000001U
#define TOUCH_SCAN_DONE_INT_RAW_S  0
/** TOUCH_DONE_INT_RAW : R/WTC/SS; bitpos: [1]; default: 0;
 *  need_des
 */
#define TOUCH_DONE_INT_RAW    (BIT(1))
#define TOUCH_DONE_INT_RAW_M  (TOUCH_DONE_INT_RAW_V << TOUCH_DONE_INT_RAW_S)
#define TOUCH_DONE_INT_RAW_V  0x00000001U
#define TOUCH_DONE_INT_RAW_S  1
/** TOUCH_ACTIVE_INT_RAW : R/WTC/SS; bitpos: [2]; default: 0;
 *  need_des
 */
#define TOUCH_ACTIVE_INT_RAW    (BIT(2))
#define TOUCH_ACTIVE_INT_RAW_M  (TOUCH_ACTIVE_INT_RAW_V << TOUCH_ACTIVE_INT_RAW_S)
#define TOUCH_ACTIVE_INT_RAW_V  0x00000001U
#define TOUCH_ACTIVE_INT_RAW_S  2
/** TOUCH_INACTIVE_INT_RAW : R/WTC/SS; bitpos: [3]; default: 0;
 *  need_des
 */
#define TOUCH_INACTIVE_INT_RAW    (BIT(3))
#define TOUCH_INACTIVE_INT_RAW_M  (TOUCH_INACTIVE_INT_RAW_V << TOUCH_INACTIVE_INT_RAW_S)
#define TOUCH_INACTIVE_INT_RAW_V  0x00000001U
#define TOUCH_INACTIVE_INT_RAW_S  3
/** TOUCH_TIMEOUT_INT_RAW : R/WTC/SS; bitpos: [4]; default: 0;
 *  need_des
 */
#define TOUCH_TIMEOUT_INT_RAW    (BIT(4))
#define TOUCH_TIMEOUT_INT_RAW_M  (TOUCH_TIMEOUT_INT_RAW_V << TOUCH_TIMEOUT_INT_RAW_S)
#define TOUCH_TIMEOUT_INT_RAW_V  0x00000001U
#define TOUCH_TIMEOUT_INT_RAW_S  4
/** TOUCH_APPROACH_LOOP_DONE_INT_RAW : R/WTC/SS; bitpos: [5]; default: 0;
 *  need_des
 */
#define TOUCH_APPROACH_LOOP_DONE_INT_RAW    (BIT(5))
#define TOUCH_APPROACH_LOOP_DONE_INT_RAW_M  (TOUCH_APPROACH_LOOP_DONE_INT_RAW_V << TOUCH_APPROACH_LOOP_DONE_INT_RAW_S)
#define TOUCH_APPROACH_LOOP_DONE_INT_RAW_V  0x00000001U
#define TOUCH_APPROACH_LOOP_DONE_INT_RAW_S  5
/** TOUCH_BASELINE_UPDATE_INT_RAW : R/WTC/SS; bitpos: [6]; default: 0;
 *  need_des
 */
#define TOUCH_BASELINE_UPDATE_INT_RAW    (BIT(6))
#define TOUCH_BASELINE_UPDATE_INT_RAW_M  (TOUCH_BASELINE_UPDATE_INT_RAW_V << TOUCH_BASELINE_UPDATE_INT_RAW_S)
#define TOUCH_BASELINE_UPDATE_INT_RAW_V  0x00000001U
#define TOUCH_BASELINE_UPDATE_INT_RAW_S  6

/** TOUCH_INT_ST_REG register
 *  need_des
 */
#define TOUCH_INT_ST_REG (DR_REG_TOUCH_SENS_BASE + 0x4)
/** TOUCH_SCAN_DONE_INT_ST : RO; bitpos: [0]; default: 0;
 *  need_des
 */
#define TOUCH_SCAN_DONE_INT_ST    (BIT(0))
#define TOUCH_SCAN_DONE_INT_ST_M  (TOUCH_SCAN_DONE_INT_ST_V << TOUCH_SCAN_DONE_INT_ST_S)
#define TOUCH_SCAN_DONE_INT_ST_V  0x00000001U
#define TOUCH_SCAN_DONE_INT_ST_S  0
/** TOUCH_DONE_INT_ST : RO; bitpos: [1]; default: 0;
 *  need_des
 */
#define TOUCH_DONE_INT_ST    (BIT(1))
#define TOUCH_DONE_INT_ST_M  (TOUCH_DONE_INT_ST_V << TOUCH_DONE_INT_ST_S)
#define TOUCH_DONE_INT_ST_V  0x00000001U
#define TOUCH_DONE_INT_ST_S  1
/** TOUCH_ACTIVE_INT_ST : RO; bitpos: [2]; default: 0;
 *  need_des
 */
#define TOUCH_ACTIVE_INT_ST    (BIT(2))
#define TOUCH_ACTIVE_INT_ST_M  (TOUCH_ACTIVE_INT_ST_V << TOUCH_ACTIVE_INT_ST_S)
#define TOUCH_ACTIVE_INT_ST_V  0x00000001U
#define TOUCH_ACTIVE_INT_ST_S  2
/** TOUCH_INACTIVE_INT_ST : RO; bitpos: [3]; default: 0;
 *  need_des
 */
#define TOUCH_INACTIVE_INT_ST    (BIT(3))
#define TOUCH_INACTIVE_INT_ST_M  (TOUCH_INACTIVE_INT_ST_V << TOUCH_INACTIVE_INT_ST_S)
#define TOUCH_INACTIVE_INT_ST_V  0x00000001U
#define TOUCH_INACTIVE_INT_ST_S  3
/** TOUCH_TIMEOUT_INT_ST : RO; bitpos: [4]; default: 0;
 *  need_des
 */
#define TOUCH_TIMEOUT_INT_ST    (BIT(4))
#define TOUCH_TIMEOUT_INT_ST_M  (TOUCH_TIMEOUT_INT_ST_V << TOUCH_TIMEOUT_INT_ST_S)
#define TOUCH_TIMEOUT_INT_ST_V  0x00000001U
#define TOUCH_TIMEOUT_INT_ST_S  4
/** TOUCH_APPROACH_LOOP_DONE_INT_ST : RO; bitpos: [5]; default: 0;
 *  need_des
 */
#define TOUCH_APPROACH_LOOP_DONE_INT_ST    (BIT(5))
#define TOUCH_APPROACH_LOOP_DONE_INT_ST_M  (TOUCH_APPROACH_LOOP_DONE_INT_ST_V << TOUCH_APPROACH_LOOP_DONE_INT_ST_S)
#define TOUCH_APPROACH_LOOP_DONE_INT_ST_V  0x00000001U
#define TOUCH_APPROACH_LOOP_DONE_INT_ST_S  5
/** TOUCH_BASELINE_UPDATE_INT_ST : RO; bitpos: [6]; default: 0;
 *  need_des
 */
#define TOUCH_BASELINE_UPDATE_INT_ST    (BIT(6))
#define TOUCH_BASELINE_UPDATE_INT_ST_M  (TOUCH_BASELINE_UPDATE_INT_ST_V << TOUCH_BASELINE_UPDATE_INT_ST_S)
#define TOUCH_BASELINE_UPDATE_INT_ST_V  0x00000001U
#define TOUCH_BASELINE_UPDATE_INT_ST_S  6

/** TOUCH_INT_ENA_REG register
 *  need_des
 */
#define TOUCH_INT_ENA_REG (DR_REG_TOUCH_SENS_BASE + 0x8)
/** TOUCH_SCAN_DONE_INT_ENA : R/W; bitpos: [0]; default: 0;
 *  need_des
 */
#define TOUCH_SCAN_DONE_INT_ENA    (BIT(0))
#define TOUCH_SCAN_DONE_INT_ENA_M  (TOUCH_SCAN_DONE_INT_ENA_V << TOUCH_SCAN_DONE_INT_ENA_S)
#define TOUCH_SCAN_DONE_INT_ENA_V  0x00000001U
#define TOUCH_SCAN_DONE_INT_ENA_S  0
/** TOUCH_DONE_INT_ENA : R/W; bitpos: [1]; default: 0;
 *  need_des
 */
#define TOUCH_DONE_INT_ENA    (BIT(1))
#define TOUCH_DONE_INT_ENA_M  (TOUCH_DONE_INT_ENA_V << TOUCH_DONE_INT_ENA_S)
#define TOUCH_DONE_INT_ENA_V  0x00000001U
#define TOUCH_DONE_INT_ENA_S  1
/** TOUCH_ACTIVE_INT_ENA : R/W; bitpos: [2]; default: 0;
 *  need_des
 */
#define TOUCH_ACTIVE_INT_ENA    (BIT(2))
#define TOUCH_ACTIVE_INT_ENA_M  (TOUCH_ACTIVE_INT_ENA_V << TOUCH_ACTIVE_INT_ENA_S)
#define TOUCH_ACTIVE_INT_ENA_V  0x00000001U
#define TOUCH_ACTIVE_INT_ENA_S  2
/** TOUCH_INACTIVE_INT_ENA : R/W; bitpos: [3]; default: 0;
 *  need_des
 */
#define TOUCH_INACTIVE_INT_ENA    (BIT(3))
#define TOUCH_INACTIVE_INT_ENA_M  (TOUCH_INACTIVE_INT_ENA_V << TOUCH_INACTIVE_INT_ENA_S)
#define TOUCH_INACTIVE_INT_ENA_V  0x00000001U
#define TOUCH_INACTIVE_INT_ENA_S  3
/** TOUCH_TIMEOUT_INT_ENA : R/W; bitpos: [4]; default: 0;
 *  need_des
 */
#define TOUCH_TIMEOUT_INT_ENA    (BIT(4))
#define TOUCH_TIMEOUT_INT_ENA_M  (TOUCH_TIMEOUT_INT_ENA_V << TOUCH_TIMEOUT_INT_ENA_S)
#define TOUCH_TIMEOUT_INT_ENA_V  0x00000001U
#define TOUCH_TIMEOUT_INT_ENA_S  4
/** TOUCH_APPROACH_LOOP_DONE_INT_ENA : R/W; bitpos: [5]; default: 0;
 *  need_des
 */
#define TOUCH_APPROACH_LOOP_DONE_INT_ENA    (BIT(5))
#define TOUCH_APPROACH_LOOP_DONE_INT_ENA_M  (TOUCH_APPROACH_LOOP_DONE_INT_ENA_V << TOUCH_APPROACH_LOOP_DONE_INT_ENA_S)
#define TOUCH_APPROACH_LOOP_DONE_INT_ENA_V  0x00000001U
#define TOUCH_APPROACH_LOOP_DONE_INT_ENA_S  5
/** TOUCH_BASELINE_UPDATE_INT_ENA : R/W; bitpos: [6]; default: 0;
 *  need_des
 */
#define TOUCH_BASELINE_UPDATE_INT_ENA    (BIT(6))
#define TOUCH_BASELINE_UPDATE_INT_ENA_M  (TOUCH_BASELINE_UPDATE_INT_ENA_V << TOUCH_BASELINE_UPDATE_INT_ENA_S)
#define TOUCH_BASELINE_UPDATE_INT_ENA_V  0x00000001U
#define TOUCH_BASELINE_UPDATE_INT_ENA_S  6

/** TOUCH_INT_CLR_REG register
 *  need_des
 */
#define TOUCH_INT_CLR_REG (DR_REG_TOUCH_SENS_BASE + 0xc)
/** TOUCH_SCAN_DONE_INT_CLR : WT; bitpos: [0]; default: 0;
 *  need_des
 */
#define TOUCH_SCAN_DONE_INT_CLR    (BIT(0))
#define TOUCH_SCAN_DONE_INT_CLR_M  (TOUCH_SCAN_DONE_INT_CLR_V << TOUCH_SCAN_DONE_INT_CLR_S)
#define TOUCH_SCAN_DONE_INT_CLR_V  0x00000001U
#define TOUCH_SCAN_DONE_INT_CLR_S  0
/** TOUCH_DONE_INT_CLR : WT; bitpos: [1]; default: 0;
 *  need_des
 */
#define TOUCH_DONE_INT_CLR    (BIT(1))
#define TOUCH_DONE_INT_CLR_M  (TOUCH_DONE_INT_CLR_V << TOUCH_DONE_INT_CLR_S)
#define TOUCH_DONE_INT_CLR_V  0x00000001U
#define TOUCH_DONE_INT_CLR_S  1
/** TOUCH_ACTIVE_INT_CLR : WT; bitpos: [2]; default: 0;
 *  need_des
 */
#define TOUCH_ACTIVE_INT_CLR    (BIT(2))
#define TOUCH_ACTIVE_INT_CLR_M  (TOUCH_ACTIVE_INT_CLR_V << TOUCH_ACTIVE_INT_CLR_S)
#define TOUCH_ACTIVE_INT_CLR_V  0x00000001U
#define TOUCH_ACTIVE_INT_CLR_S  2
/** TOUCH_INACTIVE_INT_CLR : WT; bitpos: [3]; default: 0;
 *  need_des
 */
#define TOUCH_INACTIVE_INT_CLR    (BIT(3))
#define TOUCH_INACTIVE_INT_CLR_M  (TOUCH_INACTIVE_INT_CLR_V << TOUCH_INACTIVE_INT_CLR_S)
#define TOUCH_INACTIVE_INT_CLR_V  0x00000001U
#define TOUCH_INACTIVE_INT_CLR_S  3
/** TOUCH_TIMEOUT_INT_CLR : WT; bitpos: [4]; default: 0;
 *  need_des
 */
#define TOUCH_TIMEOUT_INT_CLR    (BIT(4))
#define TOUCH_TIMEOUT_INT_CLR_M  (TOUCH_TIMEOUT_INT_CLR_V << TOUCH_TIMEOUT_INT_CLR_S)
#define TOUCH_TIMEOUT_INT_CLR_V  0x00000001U
#define TOUCH_TIMEOUT_INT_CLR_S  4
/** TOUCH_APPROACH_LOOP_DONE_INT_CLR : WT; bitpos: [5]; default: 0;
 *  need_des
 */
#define TOUCH_APPROACH_LOOP_DONE_INT_CLR    (BIT(5))
#define TOUCH_APPROACH_LOOP_DONE_INT_CLR_M  (TOUCH_APPROACH_LOOP_DONE_INT_CLR_V << TOUCH_APPROACH_LOOP_DONE_INT_CLR_S)
#define TOUCH_APPROACH_LOOP_DONE_INT_CLR_V  0x00000001U
#define TOUCH_APPROACH_LOOP_DONE_INT_CLR_S  5
/** TOUCH_BASELINE_UPDATE_INT_CLR : WT; bitpos: [6]; default: 0;
 *  need_des
 */
#define TOUCH_BASELINE_UPDATE_INT_CLR    (BIT(6))
#define TOUCH_BASELINE_UPDATE_INT_CLR_M  (TOUCH_BASELINE_UPDATE_INT_CLR_V << TOUCH_BASELINE_UPDATE_INT_CLR_S)
#define TOUCH_BASELINE_UPDATE_INT_CLR_V  0x00000001U
#define TOUCH_BASELINE_UPDATE_INT_CLR_S  6

/** TOUCH_CHN_STATUS_REG register
 *  need_des
 */
#define TOUCH_CHN_STATUS_REG (DR_REG_TOUCH_SENS_BASE + 0x10)
/** TOUCH_PAD_ACTIVE : RO; bitpos: [14:0]; default: 0;
 *  need_des
 */
#define TOUCH_PAD_ACTIVE    0x00007FFFU
#define TOUCH_PAD_ACTIVE_M  (TOUCH_PAD_ACTIVE_V << TOUCH_PAD_ACTIVE_S)
#define TOUCH_PAD_ACTIVE_V  0x00007FFFU
#define TOUCH_PAD_ACTIVE_S  0
/** TOUCH_MEAS_DONE : RO; bitpos: [15]; default: 0;
 *  need_des
 */
#define TOUCH_MEAS_DONE    (BIT(15))
#define TOUCH_MEAS_DONE_M  (TOUCH_MEAS_DONE_V << TOUCH_MEAS_DONE_S)
#define TOUCH_MEAS_DONE_V  0x00000001U
#define TOUCH_MEAS_DONE_S  15
/** TOUCH_SCAN_CURR : RO; bitpos: [19:16]; default: 15;
 *  need_des
 */
#define TOUCH_SCAN_CURR    0x0000000FU
#define TOUCH_SCAN_CURR_M  (TOUCH_SCAN_CURR_V << TOUCH_SCAN_CURR_S)
#define TOUCH_SCAN_CURR_V  0x0000000FU
#define TOUCH_SCAN_CURR_S  16

/** TOUCH_STATUS_0_REG register
 *  need_des
 */
#define TOUCH_STATUS_0_REG (DR_REG_TOUCH_SENS_BASE + 0x14)
/** TOUCH_PAD0_DATA : RO; bitpos: [15:0]; default: 0;
 *  need_des
 */
#define TOUCH_PAD0_DATA    0x0000FFFFU
#define TOUCH_PAD0_DATA_M  (TOUCH_PAD0_DATA_V << TOUCH_PAD0_DATA_S)
#define TOUCH_PAD0_DATA_V  0x0000FFFFU
#define TOUCH_PAD0_DATA_S  0
/** TOUCH_PAD0_DEBOUNCE_CNT : RO; bitpos: [18:16]; default: 0;
 *  need_des
 */
#define TOUCH_PAD0_DEBOUNCE_CNT    0x00000007U
#define TOUCH_PAD0_DEBOUNCE_CNT_M  (TOUCH_PAD0_DEBOUNCE_CNT_V << TOUCH_PAD0_DEBOUNCE_CNT_S)
#define TOUCH_PAD0_DEBOUNCE_CNT_V  0x00000007U
#define TOUCH_PAD0_DEBOUNCE_CNT_S  16
/** TOUCH_PAD0_NN_CNT : RO; bitpos: [22:19]; default: 0;
 *  need_des
 */
#define TOUCH_PAD0_NN_CNT    0x0000000FU
#define TOUCH_PAD0_NN_CNT_M  (TOUCH_PAD0_NN_CNT_V << TOUCH_PAD0_NN_CNT_S)
#define TOUCH_PAD0_NN_CNT_V  0x0000000FU
#define TOUCH_PAD0_NN_CNT_S  19

