espressif/esp-idf/components/soc/esp32h4/register/soc/touch_reg.h
/** TOUCH_STATUS_1_REG register
 *  need_des
 */
#define TOUCH_STATUS_1_REG (DR_REG_TOUCH_SENS_BASE + 0x18)
/** TOUCH_PAD1_DATA : RO; bitpos: [15:0]; default: 0;
 *  need_des
 */
#define TOUCH_PAD1_DATA    0x0000FFFFU
#define TOUCH_PAD1_DATA_M  (TOUCH_PAD1_DATA_V << TOUCH_PAD1_DATA_S)
#define TOUCH_PAD1_DATA_V  0x0000FFFFU
#define TOUCH_PAD1_DATA_S  0
/** TOUCH_PAD1_DEBOUNCE_CNT : RO; bitpos: [18:16]; default: 0;
 *  need_des
 */
#define TOUCH_PAD1_DEBOUNCE_CNT    0x00000007U
#define TOUCH_PAD1_DEBOUNCE_CNT_M  (TOUCH_PAD1_DEBOUNCE_CNT_V << TOUCH_PAD1_DEBOUNCE_CNT_S)
#define TOUCH_PAD1_DEBOUNCE_CNT_V  0x00000007U
#define TOUCH_PAD1_DEBOUNCE_CNT_S  16
/** TOUCH_PAD1_NN_CNT : RO; bitpos: [22:19]; default: 0;
 *  need_des
 */
#define TOUCH_PAD1_NN_CNT    0x0000000FU
#define TOUCH_PAD1_NN_CNT_M  (TOUCH_PAD1_NN_CNT_V << TOUCH_PAD1_NN_CNT_S)
#define TOUCH_PAD1_NN_CNT_V  0x0000000FU
#define TOUCH_PAD1_NN_CNT_S  19

/** TOUCH_STATUS_2_REG register
 *  need_des
 */
#define TOUCH_STATUS_2_REG (DR_REG_TOUCH_SENS_BASE + 0x1c)
/** TOUCH_PAD2_DATA : RO; bitpos: [15:0]; default: 0;
 *  need_des
 */
#define TOUCH_PAD2_DATA    0x0000FFFFU
#define TOUCH_PAD2_DATA_M  (TOUCH_PAD2_DATA_V << TOUCH_PAD2_DATA_S)
#define TOUCH_PAD2_DATA_V  0x0000FFFFU
#define TOUCH_PAD2_DATA_S  0
/** TOUCH_PAD2_DEBOUNCE_CNT : RO; bitpos: [18:16]; default: 0;
 *  need_des
 */
#define TOUCH_PAD2_DEBOUNCE_CNT    0x00000007U
#define TOUCH_PAD2_DEBOUNCE_CNT_M  (TOUCH_PAD2_DEBOUNCE_CNT_V << TOUCH_PAD2_DEBOUNCE_CNT_S)
#define TOUCH_PAD2_DEBOUNCE_CNT_V  0x00000007U
#define TOUCH_PAD2_DEBOUNCE_CNT_S  16
/** TOUCH_PAD2_NN_CNT : RO; bitpos: [22:19]; default: 0;
 *  need_des
 */
#define TOUCH_PAD2_NN_CNT    0x0000000FU
#define TOUCH_PAD2_NN_CNT_M  (TOUCH_PAD2_NN_CNT_V << TOUCH_PAD2_NN_CNT_S)
#define TOUCH_PAD2_NN_CNT_V  0x0000000FU
#define TOUCH_PAD2_NN_CNT_S  19

/** TOUCH_STATUS_3_REG register
 *  need_des
 */
#define TOUCH_STATUS_3_REG (DR_REG_TOUCH_SENS_BASE + 0x20)
/** TOUCH_PAD3_DATA : RO; bitpos: [15:0]; default: 0;
 *  need_des
 */
#define TOUCH_PAD3_DATA    0x0000FFFFU
#define TOUCH_PAD3_DATA_M  (TOUCH_PAD3_DATA_V << TOUCH_PAD3_DATA_S)
#define TOUCH_PAD3_DATA_V  0x0000FFFFU
#define TOUCH_PAD3_DATA_S  0
/** TOUCH_PAD3_DEBOUNCE_CNT : RO; bitpos: [18:16]; default: 0;
 *  need_des
 */
#define TOUCH_PAD3_DEBOUNCE_CNT    0x00000007U
#define TOUCH_PAD3_DEBOUNCE_CNT_M  (TOUCH_PAD3_DEBOUNCE_CNT_V << TOUCH_PAD3_DEBOUNCE_CNT_S)
#define TOUCH_PAD3_DEBOUNCE_CNT_V  0x00000007U
#define TOUCH_PAD3_DEBOUNCE_CNT_S  16
/** TOUCH_PAD3_NN_CNT : RO; bitpos: [22:19]; default: 0;
 *  need_des
 */
#define TOUCH_PAD3_NN_CNT    0x0000000FU
#define TOUCH_PAD3_NN_CNT_M  (TOUCH_PAD3_NN_CNT_V << TOUCH_PAD3_NN_CNT_S)
#define TOUCH_PAD3_NN_CNT_V  0x0000000FU
#define TOUCH_PAD3_NN_CNT_S  19

/** TOUCH_STATUS_4_REG register
 *  need_des
 */
#define TOUCH_STATUS_4_REG (DR_REG_TOUCH_SENS_BASE + 0x24)
/** TOUCH_PAD4_DATA : RO; bitpos: [15:0]; default: 0;
 *  need_des
 */
#define TOUCH_PAD4_DATA    0x0000FFFFU
#define TOUCH_PAD4_DATA_M  (TOUCH_PAD4_DATA_V << TOUCH_PAD4_DATA_S)
#define TOUCH_PAD4_DATA_V  0x0000FFFFU
#define TOUCH_PAD4_DATA_S  0
/** TOUCH_PAD4_DEBOUNCE_CNT : RO; bitpos: [18:16]; default: 0;
 *  need_des
 */
#define TOUCH_PAD4_DEBOUNCE_CNT    0x00000007U
#define TOUCH_PAD4_DEBOUNCE_CNT_M  (TOUCH_PAD4_DEBOUNCE_CNT_V << TOUCH_PAD4_DEBOUNCE_CNT_S)
#define TOUCH_PAD4_DEBOUNCE_CNT_V  0x00000007U
#define TOUCH_PAD4_DEBOUNCE_CNT_S  16
/** TOUCH_PAD4_NN_CNT : RO; bitpos: [22:19]; default: 0;
 *  need_des
 */
#define TOUCH_PAD4_NN_CNT    0x0000000FU
#define TOUCH_PAD4_NN_CNT_M  (TOUCH_PAD4_NN_CNT_V << TOUCH_PAD4_NN_CNT_S)
#define TOUCH_PAD4_NN_CNT_V  0x0000000FU
#define TOUCH_PAD4_NN_CNT_S  19

/** TOUCH_STATUS_5_REG register
 *  need_des
 */
#define TOUCH_STATUS_5_REG (DR_REG_TOUCH_SENS_BASE + 0x28)
/** TOUCH_PAD5_DATA : RO; bitpos: [15:0]; default: 0;
 *  need_des
 */
#define TOUCH_PAD5_DATA    0x0000FFFFU
#define TOUCH_PAD5_DATA_M  (TOUCH_PAD5_DATA_V << TOUCH_PAD5_DATA_S)
#define TOUCH_PAD5_DATA_V  0x0000FFFFU
#define TOUCH_PAD5_DATA_S  0
/** TOUCH_PAD5_DEBOUNCE_CNT : RO; bitpos: [18:16]; default: 0;
 *  need_des
 */
#define TOUCH_PAD5_DEBOUNCE_CNT    0x00000007U
#define TOUCH_PAD5_DEBOUNCE_CNT_M  (TOUCH_PAD5_DEBOUNCE_CNT_V << TOUCH_PAD5_DEBOUNCE_CNT_S)
#define TOUCH_PAD5_DEBOUNCE_CNT_V  0x00000007U
#define TOUCH_PAD5_DEBOUNCE_CNT_S  16
/** TOUCH_PAD5_NN_CNT : RO; bitpos: [22:19]; default: 0;
 *  need_des
 */
#define TOUCH_PAD5_NN_CNT    0x0000000FU
#define TOUCH_PAD5_NN_CNT_M  (TOUCH_PAD5_NN_CNT_V << TOUCH_PAD5_NN_CNT_S)
#define TOUCH_PAD5_NN_CNT_V  0x0000000FU
#define TOUCH_PAD5_NN_CNT_S  19

/** TOUCH_STATUS_6_REG register
 *  need_des
 */
#define TOUCH_STATUS_6_REG (DR_REG_TOUCH_SENS_BASE + 0x2c)
/** TOUCH_PAD6_DATA : RO; bitpos: [15:0]; default: 0;
 *  need_des
 */
#define TOUCH_PAD6_DATA    0x0000FFFFU
#define TOUCH_PAD6_DATA_M  (TOUCH_PAD6_DATA_V << TOUCH_PAD6_DATA_S)
#define TOUCH_PAD6_DATA_V  0x0000FFFFU
#define TOUCH_PAD6_DATA_S  0
/** TOUCH_PAD6_DEBOUNCE_CNT : RO; bitpos: [18:16]; default: 0;
 *  need_des
 */
#define TOUCH_PAD6_DEBOUNCE_CNT    0x00000007U
#define TOUCH_PAD6_DEBOUNCE_CNT_M  (TOUCH_PAD6_DEBOUNCE_CNT_V << TOUCH_PAD6_DEBOUNCE_CNT_S)
#define TOUCH_PAD6_DEBOUNCE_CNT_V  0x00000007U
#define TOUCH_PAD6_DEBOUNCE_CNT_S  16
/** TOUCH_PAD6_NN_CNT : RO; bitpos: [22:19]; default: 0;
 *  need_des
 */
#define TOUCH_PAD6_NN_CNT    0x0000000FU
#define TOUCH_PAD6_NN_CNT_M  (TOUCH_PAD6_NN_CNT_V << TOUCH_PAD6_NN_CNT_S)
#define TOUCH_PAD6_NN_CNT_V  0x0000000FU
#define TOUCH_PAD6_NN_CNT_S  19

/** TOUCH_STATUS_7_REG register
 *  need_des
 */
#define TOUCH_STATUS_7_REG (DR_REG_TOUCH_SENS_BASE + 0x30)
/** TOUCH_PAD7_DATA : RO; bitpos: [15:0]; default: 0;
 *  need_des
 */
#define TOUCH_PAD7_DATA    0x0000FFFFU
#define TOUCH_PAD7_DATA_M  (TOUCH_PAD7_DATA_V << TOUCH_PAD7_DATA_S)
#define TOUCH_PAD7_DATA_V  0x0000FFFFU
#define TOUCH_PAD7_DATA_S  0
/** TOUCH_PAD7_DEBOUNCE_CNT : RO; bitpos: [18:16]; default: 0;
 *  need_des
 */
#define TOUCH_PAD7_DEBOUNCE_CNT    0x00000007U
#define TOUCH_PAD7_DEBOUNCE_CNT_M  (TOUCH_PAD7_DEBOUNCE_CNT_V << TOUCH_PAD7_DEBOUNCE_CNT_S)
#define TOUCH_PAD7_DEBOUNCE_CNT_V  0x00000007U
#define TOUCH_PAD7_DEBOUNCE_CNT_S  16
/** TOUCH_PAD7_NN_CNT : RO; bitpos: [22:19]; default: 0;
 *  need_des
 */
#define TOUCH_PAD7_NN_CNT    0x0000000FU
#define TOUCH_PAD7_NN_CNT_M  (TOUCH_PAD7_NN_CNT_V << TOUCH_PAD7_NN_CNT_S)
#define TOUCH_PAD7_NN_CNT_V  0x0000000FU
#define TOUCH_PAD7_NN_CNT_S  19

